In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import matplotlib
from datetime import datetime 
from pandas_datareader import data

matplotlib.rcParams['font.family']='Malgun Gothic'
matplotlib.rcParams['axes.unicode_minus'] = False

In [2]:
data = np.random.randint(1,10, size=4)
data

array([7, 9, 2, 4])

In [3]:
data = np.random.randint(30,101, size=(4,6) )
data

array([[70, 52, 91, 60, 41, 52],
       [49, 85, 83, 84, 96, 85],
       [89, 35, 38, 89, 33, 61],
       [91, 53, 35, 81, 52, 48]])

In [4]:
df = pd.DataFrame( data )
df

    0   1   2   3   4   5
0  70  52  91  60  41  52
1  49  85  83  84  96  85
2  89  35  38  89  33  61
3  91  53  35  81  52  48

In [5]:
df['년도'] = [2018,2018,2019,2019]
df['반'] = ['1반','2반','1반','2반']
df

    0   1   2   3   4   5    년도   반
0  70  52  91  60  41  52  2018  1반
1  49  85  83  84  96  85  2018  2반
2  89  35  38  89  33  61  2019  1반
3  91  53  35  81  52  48  2019  2반

### 칼럼 -> 인덱스

In [6]:
df.set_index(['년도', '반'])

          0   1   2   3   4   5
년도   반
2018 1반  70  52  91  60  41  52
     2반  49  85  83  84  96  85
2019 1반  89  35  38  89  33  61
     2반  91  53  35  81  52  48

### 멀티 인덱스 직접 만들기 pd.MultiIndex.from_product

In [8]:
# 멀티 인덱스 설정
# 멀티 인덱스를 만들어주는 함수 : pd.MultiIndex.from_product
# set_index는 기존의 칼럼을 가지고와서 인덱스로 설정하는 것이라면
# pd.MultiIndex.from_product는 인덱스를 직접 설정 -> 만들어 주는 거!

df.index = pd.MultiIndex.from_product([[2018, 2019], ['1반', '2반']], 
                          names=['년도', '반'])

df

          0   1   2   3   4   5    년도   반
년도   반
2018 1반  70  52  91  60  41  52  2018  1반
     2반  49  85  83  84  96  85  2018  2반
2019 1반  89  35  38  89  33  61  2019  1반
     2반  91  53  35  81  52  48  2019  2반

In [9]:
df.index

MultiIndex([(2018, '1반'),
            (2018, '2반'),
            (2019, '1반'),
            (2019, '2반')],
           names=['년도', '반'])

In [10]:
# 싱글인덱스랑 같음

df.index.levels[0]

Int64Index([2018, 2019], dtype='int64', name='년도')

In [12]:
df.index.levels[1]

Index(['1반', '2반'], dtype='object', name='반')

In [13]:
# 위에꺼랑 차이

df.index.get_level_values(0)

Int64Index([2018, 2018, 2019, 2019], dtype='int64', name='년도')

In [14]:
df.index.get_level_values(1)

Index(['1반', '2반', '1반', '2반'], dtype='object', name='반')

In [16]:
df

          0   1   2   3   4   5    년도   반
년도   반
2018 1반  70  52  91  60  41  52  2018  1반
     2반  49  85  83  84  96  85  2018  2반
2019 1반  89  35  38  89  33  61  2019  1반
     2반  91  53  35  81  52  48  2019  2반

In [17]:
df.drop(columns=['년도', '반'], inplace=True)

In [18]:
df

          0   1   2   3   4   5
년도   반
2018 1반  70  52  91  60  41  52
     2반  49  85  83  84  96  85
2019 1반  89  35  38  89  33  61
     2반  91  53  35  81  52  48

### 인덱스 -> 칼럼

In [19]:
#인덱스를 칼럼으로 만들어 줌
# <-> set_index() : 칼럼을 인덱스로

df.reset_index()

     년도   반   0   1   2   3   4   5
0  2018  1반  70  52  91  60  41  52
1  2018  2반  49  85  83  84  96  85
2  2019  1반  89  35  38  89  33  61
3  2019  2반  91  53  35  81  52  48

In [20]:
df

          0   1   2   3   4   5
년도   반
2018 1반  70  52  91  60  41  52
     2반  49  85  83  84  96  85
2019 1반  89  35  38  89  33  61
     2반  91  53  35  81  52  48

In [22]:
df.loc[2018]

     0   1   2   3   4   5
반
1반  70  52  91  60  41  52
2반  49  85  83  84  96  85

### 멀티칼럼 만들기 pd.MultiIndex.from_product

In [23]:
df.columns = pd.MultiIndex.from_product( [['홍길동','이순신','임꺽정'],
                                          ['국어','영어'] ]  )
df

        홍길동     이순신     임꺽정
         국어  영어  국어  영어  국어  영어
년도   반
2018 1반  70  52  91  60  41  52
     2반  49  85  83  84  96  85
2019 1반  89  35  38  89  33  61
     2반  91  53  35  81  52  48

In [24]:
df.columns

MultiIndex([('홍길동', '국어'),
            ('홍길동', '영어'),
            ('이순신', '국어'),
            ('이순신', '영어'),
            ('임꺽정', '국어'),
            ('임꺽정', '영어')],
           )

In [25]:
df.columns.levels[0]

Index(['이순신', '임꺽정', '홍길동'], dtype='object')

In [26]:
df.columns.levels[1]

Index(['국어', '영어'], dtype='object')